package org.rambler.games.ps.db.migration;

import org.flywaydb.core.api.migration.spring.SpringJdbcMigration;
import org.springframework.jdbc.core.JdbcTemplate;

/**
 * @author yuanzhou on 2017/12/18.
 */
public class V1_0_0_1513598193__Init implements SpringJdbcMigration {
    @Override
    public void migrate(JdbcTemplate jdbcTemplate) throws Exception {
        jdbcTemplate.execute("CREATE TABLE IF NOT EXISTS `shop` (" +
                "  `id` int(11) NOT NULL," +
                "  `name` varchar(125) NOT NULL," +
                "  `code` varchar(30) NOT NULL," +
                "  `city` varchar(30) NOT NULL," +
                "  `province` varchar(30) NOT NULL," +
                "   PRIMARY KEY (`id`)" +
                ") ENGINE=InnoDB AUTO_INCREMENT=243 DEFAULT CHARSET=utf8;");

        jdbcTemplate.execute("INSERT INTO `shop` (`id`, `name`, `code`, `city`, `province`) VALUES" +
                "(1, '北京金街购物中心MALL', 'E0009892', '北京市', '北京市')," +
                "(2, '北京翠微牡丹园店', 'E0009928', '北京市', '北京市')," +
                "(3, '北京圣拉娜SOLANAMALL', 'E0009654', '北京市', '北京市')," +
                "(4, '北京金源广场MALL', 'E0009641', '北京市', '北京市')," +
                "(5, '北京翠微百货', 'E0009667', '北京市', '北京市')," +
                "(6, '北京百盛', 'E0009673', '北京市', '北京市')," +
                "(7, '北京大兴王府井', 'E0009664', '北京市', '北京市')," +
                "(8, '北京汉光', 'E0009640', '北京市', '北京市')," +
                "(9, '北京龙德翠微店', 'E0009866', '北京市', '北京市')," +
                "(10, '北京顺义新世界', 'E0009864', '北京市', '北京市')," +
                "(11, '北京崇文新世界', 'E0009655', '北京市', '北京市')," +
                "(12, '北京王府井', 'E0009646', '北京市', '北京市')," +
                "(13, '北京华贸EP雅莹之家', 'E0009653', '北京市', '北京市')," +
                "(14, '沈阳新玛特', 'E0009094', '沈阳市', '辽宁省')," +
                "(15, '沈阳中兴新一城', 'E0009818', '沈阳市', '辽宁省')," +
                "(16, '沈阳铁西万象汇MALL', 'E0009823', '沈阳市', '辽宁省')," +
                "(17, '沈阳卓展', 'E0009093', '沈阳市', '辽宁省')," +
                "(18, '沈阳中兴高级', 'E0009100', '沈阳市', '辽宁省')," +
                "(19, '沈阳万象城MALL', 'E0009086', '沈阳市', '辽宁省')," +
                "(20, '成都武侯王府井', 'E0009692', '成都市', '四川省')," +
                "(21, '成都仁和春天人东店', 'E0009511', '成都市', '四川省')," +
                "(22, '成都仁和春天光华店', 'E0009513', '成都市', '四川省')," +
                "(23, '成都青羊大道店', 'M0014021', '成都市', '四川省')," +
                "(24, '成都机场G指廊店', 'E0009693', '成都市', '四川省')," +
                "(25, '成都王府井', 'E0009499', '成都市', '四川省')," +
                "(26, '成都时尚生活馆', 'E0009505', '成都市', '四川省')," +
                "(27, '成都万象城MALL', 'M0014003', '成都市', '四川省')," +
                "(28, '郑州丹尼斯大卫城MALL', 'E0009920', '郑州市', '河南省')," +
                "(29, '太原铜锣湾MALL', 'E0009921', '太原市', '山西省')," +
                "(30, '太原天美新天地', 'E0009919', '太原市', '山西省')," +
                "(31, '郑州丹尼斯花园路店', 'E0009930', '郑州市', '河南省')," +
                "(32, '郑州生活馆', 'E0009271', '郑州市', '河南省')," +
                "(33, '郑州万象城MALL', 'E0009267', '郑州市', '河南省')," +
                "(34, '郑州王府井', 'E0009257', '郑州市', '河南省')," +
                "(35, '郑州丹尼斯', 'E0009521', '郑州市', '河南省')," +
                "(36, '西安世纪金花高新店', 'E0009072', '西安市', '陕西省')," +
                "(37, '西安赛格', 'E0009883', '西安市', '陕西省')," +
                "(38, '西安世纪金花钟楼店', 'E0009697', '西安市', '陕西省')," +
                "(39, '西安咸阳机场T2店', 'E0009075', '西安市', '陕西省')," +
                "(40, '西安王府井', 'E0009809', '西安市', '陕西省')," +
                "(41, '西安世纪金花赛高店', 'E0009065', '西安市', '陕西省')," +
                "(42, '西安世纪金花珠江时代广场', 'E0009699', '西安市', '陕西省')," +
                "(43, '西安解放路生活馆', 'E0009074', '西安市', '陕西省')," +
                "(44, '西安开元商城', 'E0009063', '西安市', '陕西省')," +
                "(45, '天津友谊新都市', 'E0009018', '天津市', '天津市')," +
                "(46, '天津海信商业广场', 'E0009010', '天津市', '天津市')," +
                "(47, '天津金元宝滨海国际', 'E0009113', '天津市', '天津市')," +
                "(48, '天津金元宝', 'E0009001', '天津市', '天津市')," +
                "(49, '天津塘沽区生活馆', 'E0009020', '天津市', '天津市')," +
                "(50, '天津大友谊', 'E0009004', '天津市', '天津市')," +
                "(51, '天津友谊新天地', 'E0009002', '天津市', '天津市')," +
                "(52, '太原华宇购物中心', 'E0009078', '太原市', '山西省')," +
                "(53, '太原王府井', 'E0009079', '太原市', '山西省')," +
                "(54, '石家庄先天下广场', 'E0009056', '石家庄', '河北省')," +
                "(55, '石家庄新百', 'E0009057', '石家庄', '河北省')," +
                "(56, '石家庄北国', 'E0009055', '石家庄', '河北省')," +
                "(57, '惠州华贸天地', 'E0009936', '惠州市', '广东省')," +
                "(58, '珠海免税商场', 'L0015007', '珠海市', '广东省')," +
                "(59, '澳门威尼斯人大运河MALL', 'P0018007', '澳门', '澳门')," +
                "(60, '澳门新马路生活馆', 'P0018008', '澳门', '澳门')," +
                "(61, '深圳益田假日广场MALL', 'E0009609', '深圳市', '广东省')," +
                "(62, '深圳海雅缤纷城MALL', 'E0009738', '深圳市', '广东省')," +
                "(63, '深圳花园城MALL', 'E0009610', '深圳市', '广东省')," +
                "(64, '深圳海雅百货', 'E0009611', '深圳市', '广东省')," +
                "(65, '深圳皇庭广场MALL', 'E0009838', '深圳市', '广东省')," +
                "(66, '深圳和平茂业', 'E0009879', '深圳市', '广东省')," +
                "(67, '深圳龙岗COCOPARKMALL', 'E0009739', '深圳市', '广东省')," +
                "(68, '深圳京基KKMALL', 'E0009620', '深圳市', '广东省')," +
                "(69, '深圳金光华生活馆', 'E0009617', '深圳市', '广东省')," +
                "(70, '深圳茂业百货华强北店', 'E0009618', '深圳市', '广东省')," +
                "(71, '深圳深国投广场MALL', 'E0009607', '深圳市', '广东省')," +
                "(72, '深圳茂业南山店', 'E0009834', '深圳市', '广东省')," +
                "(73, '深圳COCOPARKMALL', 'E0009614', '深圳市', '广东省')," +
                "(74, '深圳芮欧百货', 'E0009891', '深圳市', '广东省')," +
                "(75, '厦门嘉禾来雅', 'E0009050', '厦门市', '福建省')," +
                "(76, '厦门信达免税商场', 'L0015008', '厦门市', '福建省')," +
                "(77, '厦门巴黎春天', 'E0009049', '厦门市', '福建省')," +
                "(78, '厦门中华城MALL', 'L0015037', '厦门市', '福建省')," +
                "(79, '三亚夏日百货', 'E0009860', '三亚市', '海南省')," +
                "(80, '南宁万象城MALL', 'E0009740', '南宁市', '广西')," +
                "(81, '南宁梦之岛百货', 'E0009533', '南宁市', '广西')," +
                "(82, '海口生生百货', 'L0015030', '海口市', '海南省')," +
                "(83, '海口望海国际', 'E0009541', '海口市', '海南省')," +
                "(84, '桂林微笑堂', 'E0009908', '桂林市', '广西')," +
                "(85, '广州太古汇MALL', 'L0015032', '广州市', '广东省')," +
                "(86, '广州天河城MALL', 'L0015033', '广州市', '广东省')," +
                "(87, '广州友谊商店', 'L0015011', '广州市', '广东省')," +
                "(88, '广州广百天河中怡店', 'E0009624', '广州市', '广东省')," +
                "(89, '广州新鸿基天环广场MALL', 'L0015040', '广州市', '广东省')," +
                "(90, '广州番禺专卖店', 'E0009749', '广州市', '广东省')," +
                "(91, '广州王府井', 'E0009747', '广州市', '广东省')," +
                "(92, '广州广百北京路总店', 'E0009750', '广州市', '广东省')," +
                "(93, '广州白云机场B区店', 'E0009675', '广州市', '广东省')," +
                "(94, '广州白云机场B区二店', 'E0009771', '广州市', '广东省')," +
                "(95, '广州正佳广场MALL', 'E0009744', '广州市', '广东省')," +
                "(96, '福州津泰路店', 'E0009886', '福州市', '福建省')," +
                "(97, '福州东方东百', 'L0015006', '福州市', '福建省')," +
                "(98, '福州泰禾广场MALL', 'L0015042', '福州市', '福建省')," +
                "(99, '福州东百仓山店', 'E0009836', '福州市', '福建省')," +
                "(100, '福州东百', 'E0009042', '福州市', '福建省')," +
                "(101, '福州王府井', 'L0015026', '福州市', '福建省')," +
                "(102, '东莞厚街店', 'E0009631', '东莞市', '广东省')," +
                "(103, '东莞君尚百货', 'L0015036', '东莞市', '广东省')," +
                "(104, '东莞汇一城MALL', 'L0015025', '东莞市', '广东省')," +
                "(105, '东莞专卖', 'E0009630', '东莞市', '广东省')," +
                "(106, '长沙海信', 'E0009124', '长沙市', '湖南省')," +
                "(107, '长沙王府井', 'E0009123', '长沙市', '湖南省')," +
                "(108, '长沙友谊商店', 'E0009735', '长沙市', '湖南省')," +
                "(109, '湘潭步步高广场', 'E0009909', '湘潭市', '湖南省')," +
                "(110, '武汉东湖万达百货', 'E0009689', '武汉市', '湖北省')," +
                "(111, '武汉亚贸', 'E0009493', '武汉市', '湖北省')," +
                "(112, '武汉国际广场MALL', 'E0009484', '武汉市', '湖北省')," +
                "(113, '武汉武广', 'E0009486', '武汉市', '湖北省')," +
                "(114, '武商众圆广场MALL', 'E0009814', '武汉市', '湖北省')," +
                "(115, '南昌百盛', 'E0009537', '南昌市', '江西省')," +
                "(116, '南昌财富广场', 'E0009539', '南昌市', '江西省')," +
                "(117, '南昌华润万家八一店', 'E0009108', '南昌市', '江西省')," +
                "(118, '南昌铜锣湾T.16MALL', 'E0009898', '南昌市', '江西省')," +
                "(119, '常州新世纪', 'E0009924', '常州市', '江苏省')," +
                "(120, '丹阳华地', 'E0009718', '镇江市', '江苏省')," +
                "(121, '镇江八佰伴', 'E0009893', '镇江市', '江苏省')," +
                "(122, '扬州金鹰文昌店', 'E0009872', '扬州市', '江苏省')," +
                "(123, '盐城金鹰', 'E0009874', '盐城市', '江苏省')," +
                "(124, '盐城商业大厦', 'E0009899', '盐城市', '江苏省')," +
                "(125, '徐州金鹰', 'E0009873', '徐州市', '江苏省')," +
                "(126, '无锡万象城MALL', 'E0009703', '无锡市', '江苏省')," +
                "(127, '无锡时尚生活馆', 'E0009161', '无锡市', '江苏省')," +
                "(128, '无锡海岸城MALL', 'E0009805', '无锡市', '江苏省')," +
                "(129, '无锡八佰伴', 'E0009162', '无锡市', '江苏省')," +
                "(130, '无锡商业大厦', 'E0009145', '无锡市', '江苏省')," +
                "(131, '南京江宁万达广场MALL', 'E0009688', '南京市', '江苏省')," +
                "(132, '南京金鹰新天地', 'E0009870', '南京市', '江苏省')," +
                "(133, '南京德基广场MALL', 'E0009140', '南京市', '江苏省')," +
                "(134, '南京金鹰', 'E0009871', '南京市', '江苏省')," +
                "(135, '南京新城市广场MALL', 'E0009137', '南京市', '江苏省')," +
                "(136, '南京中央商场', 'E0009817', '南京市', '江苏省')," +
                "(137, '淮安金鹰', 'E0009226', '淮安市', '江苏省')," +
                "(138, '常州泰富百货', 'E0009242', '常州市', '江苏省')," +
                "(139, '常州购物中心', 'E0009719', '常州市', '江苏省')," +
                "(140, '常州周线巷生活馆', 'E0009244', '常州市', '江苏省')," +
                "(141, '溧阳华地', 'E0009232', '常州市', '江苏省')," +
                "(142, '寿光全福元商厦', 'E0009927', '寿光市', '山东省')," +
                "(143, '淄博万象汇MALL', 'E0009820', '淄博市', '山东省')," +
                "(144, '淄博银座', 'E0009272', '淄博市', '山东省')," +
                "(145, '烟台银座', 'E0009430', '烟台市', '山东省')," +
                "(146, '潍坊银座MALL', 'E0009252', '潍坊市', '山东省')," +
                "(147, '潍坊中百', 'E0009255', '潍坊市', '山东省')," +
                "(148, '潍坊谷德广场MALL', 'E0009662', '潍坊市', '山东省')," +
                "(149, '青岛金狮广场MALL', 'E0009865', '青岛市', '山东省')," +
                "(150, '青岛银座', 'E0009637', '青岛市', '山东省')," +
                "(151, '青岛李沧万达广场MALL', 'E0009639', '青岛市', '山东省')," +
                "(152, '青岛海信奥运店', 'E0009265', '青岛市', '山东省')," +
                "(153, '青岛澳门路生活馆', 'E0009269', '青岛市', '山东省')," +
                "(154, '青岛丽达广场专卖店', 'E0009643', '青岛市', '山东省')," +
                "(155, '青岛李沧和谐广场MALL', 'E0009816', '青岛市', '山东省')," +
                "(156, '青岛百盛', 'E0009264', '青岛市', '山东省')," +
                "(157, '临沂九州商厦', 'E0009856', '临沂市', '山东省')," +
                "(158, '临沂银座', 'E0009858', '临沂市', '山东省')," +
                "(159, '临沂和谐广场MALL', 'E0009855', '临沂市', '山东省')," +
                "(160, '济南和谐广场MALL', 'E0009853', '济南市', '山东省')," +
                "(161, '济南银座商城', 'E0009248', '济南市', '山东省')," +
                "(162, '济南银座八一', 'E0009251', '济南市', '山东省')," +
                "(163, '济南恒隆广场MALL', 'E0009256', '济南市', '山东省')," +
                "(164, '济南银座洪楼', 'E0009854', '济南市', '山东省')," +
                "(165, '合肥百大CBD', 'E0009813', '合肥市', '安徽省')," +
                "(166, '合肥鼓楼', 'E0009903', '合肥市', '安徽省')," +
                "(167, '合肥商之都', 'E0009812', '合肥市', '安徽省')," +
                "(168, '上海七宝万科广场MALL', 'E0009923', '上海市', '上海市')," +
                "(169, '上海虹桥机场T2店', 'E0009902', '上海市', '上海市')," +
                "(170, '上海八佰伴', 'E0009906', '上海市', '上海市')," +
                "(171, '上海五角场百联又一城', 'E0009585', '上海市', '上海市')," +
                "(172, '上海新世界', 'E0009549', '上海市', '上海市')," +
                "(173, '上海港汇广场MALL', 'E0009592', '上海市', '上海市')," +
                "(174, '上海久光百货', 'E0009827', '上海市', '上海市')," +
                "(175, '上海汇金百货', 'E0009550', '上海市', '上海市')," +
                "(176, '上海南桥东方商厦奉贤店', 'E0009846', '上海市', '上海市')," +
                "(177, '上海青浦东方大厦', 'E0009603', '上海市', '上海市')," +
                "(178, '上海安信商业广场MALL', 'E0009568', '上海市', '上海市')," +
                "(179, '上海虹桥友谊商城', 'E0009676', '上海市', '上海市')," +
                "(180, '江阴时尚生活馆', 'E0009266', '江阴市', '江苏省')," +
                "(181, '张家港凯丽百货', 'E0009211', '苏州市', '江苏省')," +
                "(182, '张家港第一人民商场', 'E0009196', '苏州市', '江苏省')," +
                "(183, '常熟华地', 'E0009156', '苏州市', '江苏省')," +
                "(184, '张家港国购', 'E0009188', '苏州市', '江苏省')," +
                "(185, '张家港曼巴特', 'E0009810', '苏州市', '江苏省')," +
                "(186, '苏州石路', 'E0009707', '苏州市', '江苏省')," +
                "(187, '苏州高新美罗', 'E0009706', '苏州市', '江苏省')," +
                "(188, '苏州久光', 'E0009867', '苏州市', '江苏省')," +
                "(189, '昆山商厦', 'E0009186', '苏州市', '江苏省')," +
                "(190, '苏州美罗', 'E0009180', '苏州市', '江苏省')," +
                "(191, '吴江中山北路店', 'E0009189', '苏州市', '江苏省')," +
                "(192, '南通八佰伴', 'E0009711', '南通市', '江苏省')," +
                "(193, '南通文峰店', 'E0009709', '南通市', '江苏省')," +
                "(194, '江阴华地', 'E0009157', '江阴市', '江苏省')," +
                "(195, '上虞新大通', 'E0009931', '绍兴市', '浙江省')," +
                "(196, '温州府前街店', 'E0009465', '温州市', '浙江省')," +
                "(197, '温州万象城MALL', 'E0009895', '温州市', '浙江省')," +
                "(198, '温州银泰百货', 'E0009466', '温州市', '浙江省')," +
                "(199, '温岭万寿路店', 'E0009458', '温州市', '浙江省')," +
                "(200, '玉环城东路店', 'E0009456', '台州市', '浙江省')," +
                "(201, '上虞万和城', 'E0009731', '绍兴市', '浙江省')," +
                "(202, '绍兴国商', 'E0009729', '绍兴市', '浙江省')," +
                "(203, '余姚华联', 'E0009929', '宁波市', '浙江省')," +
                "(204, '宁波银泰天一店', 'E0009427', '宁波市', '浙江省')," +
                "(205, '宁波银泰万达店', 'E0009436', '宁波市', '浙江省')," +
                "(206, '余姚南雷路店', 'E0009438', '宁波市', '浙江省')," +
                "(207, '宁波银泰江东店', 'E0009435', '宁波市', '浙江省')," +
                "(208, '慈溪天九街专卖店', 'E0009420', '宁波市', '浙江省')," +
                "(209, '慈溪银泰', 'E0009728', '宁波市', '浙江省')," +
                "(210, '义乌商贸区时尚生活馆', 'E0009473', '金华市', '浙江省')," +
                "(211, '义乌迎恩门时尚生活馆', 'E0009471', '金华市', '浙江省')," +
                "(212, '金华第一百货', 'E0009472', '金华市', '浙江省')," +
                "(213, '海宁华联', 'E0009340', '嘉兴市', '浙江省')," +
                "(214, '湖州浙北大厦', 'E0009821', '湖州市', '浙江省')," +
                "(215, '湖州星火百货', 'E0009308', '湖州市', '浙江省')," +
                "(216, '杭州武林路专卖店', 'E0009295', '杭州市', '浙江省')," +
                "(217, '杭州万象城MALL', 'E0009285', '杭州市', '浙江省')," +
                "(218, '杭州西湖银泰', 'E0009301', '杭州市', '浙江省')," +
                "(219, '杭州武林银泰', 'E0009807', '杭州市', '浙江省')," +
                "(220, '杭州城西银泰城MALL', 'E0009722', '杭州市', '浙江省')," +
                "(221, '富阳富春路店', 'E0009291', '杭州市', '浙江省')," +
                "(222, '杭州解百', 'E0009286', '杭州市', '浙江省')," +
                "(223, '萧山银隆', 'E0009721', '杭州市', '浙江省')," +
                "(224, '杭州银泰庆春店', 'E0009828', '杭州市', '浙江省')," +
                "(225, '重庆新光天地', 'E0009932', '重庆市', '重庆市')," +
                "(226, '重庆永川商都', 'E0009934', '重庆市', '重庆市')," +
                "(227, '重庆大坪商都', 'M0014026', '重庆市', '重庆市')," +
                "(228, '重庆北城天街购物广场MALL', 'M0014016', '重庆市', '重庆市')," +
                "(229, '重庆万州商都', 'M0014010', '重庆市', '重庆市')," +
                "(230, '重庆世纪新都', 'M0014015', '重庆市', '重庆市')," +
                "(231, '重庆万象城MALL', 'M0014037', '重庆市', '重庆市')," +
                "(232, '重庆新世纪', 'E0009032', '重庆市', '重庆市')," +
                "(233, '重庆星光68广场MALL', 'M0014027', '重庆市', '重庆市')," +
                "(234, '重庆西城天街购物广场MALL', 'M0014012', '重庆市', '重庆市')," +
                "(235, '重庆凯瑞商都', 'M0014008', '重庆市', '重庆市')," +
                "(236, '重庆瑞成商都', 'M0014013', '重庆市', '重庆市')," +
                "(237, '重庆江北机场T2A店', 'E0009681', '重庆市', '重庆市')," +
                "(238, '重庆南岸区新世纪盛汇商都', 'E0009125', '重庆市', '重庆市')," +
                "(239, '重庆渝北商场', 'M0014011', '重庆市', '重庆市')," +
                "(240, '重庆江北机场T2B店', 'E0009680', '重庆市', '重庆市')," +
                "(241, 'EP嘉兴八佰伴', '', '嘉兴市', '浙江省')," +
                "(242, '嘉兴雅斓名店', '', '嘉兴市', '浙江省');");

        jdbcTemplate.execute("CREATE TABLE IF NOT EXISTS `prize` (" +
                "  `id` int(11) NOT NULL," +
                "  `name` varchar(125) NOT NULL DEFAULT '' COMMENT '奖品名称'," +
                "  `pic` varchar(125) NOT NULL COMMENT '奖品图片'," +
                "  `count` int(11) NOT NULL COMMENT '奖品数量'," +
                "  `lottery_count` int(11) NOT NULL COMMENT '已抽出数量'," +
                "  `weight` int(11) NOT NULL COMMENT '中奖概率(权重)'," +
                "  `code` varchar(20) NULL COMMENT '奖品代码'," +
                "  `is_del` tinyint(1) NULL DEFAULT '0'," +
                "   PRIMARY KEY (`id`)" +
                ") ENGINE=InnoDB AUTO_INCREMENT=1 DEFAULT CHARSET=utf8 CHECKSUM=1 DELAY_KEY_WRITE=1 ROW_FORMAT=DYNAMIC;");

        jdbcTemplate.execute("CREATE TABLE IF NOT EXISTS `lottery` (" +
                "  `id` int(11) NOT NULL AUTO_INCREMENT," +
                "  `oid` varchar(50) NOT NULL," +
                "  `prize_id` int(11) NOT NULL," +
                "  `add_time` TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP," +
                "  `truename` varchar(30) NULL," +
                "  `mobile` varchar(30) NULL," +
                "  `address` varchar(255) NULL," +
                "  `is_get` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否领取'," +
                "  `shop_id` int(11) NULL," +
                "  `code` varchar(125) NULL," +
                "   PRIMARY KEY (`id`)" +
                ") ENGINE=InnoDB AUTO_INCREMENT=1 DEFAULT CHARSET=utf8;");
    }
}
